{
    "title": "FireAlert Detector",
    "description": "A system that detects fire and alerts users using Arduino and flame sensors.",
    "introduction": "Fire safety is a critical concern in both domestic and industrial settings. The FireAlert Detector is an innovative solution designed to detect fires early and alert users, potentially preventing catastrophic damage. This project leverages Arduino and flame sensors to create a reliable and cost-effective fire detection system.",
    "status": "draft",
    "tags": [
        "fire-safety",
        "Arduino",
        "IoT",
        "sensors",
        "home-security",
        "innovation"
    ],
    "sections": [
        {
            "title": "Motivation",
            "body": "The motivation behind FireAlert Detector stems from the need for affordable and efficient fire detection systems. Traditional fire alarms can be expensive and often fail to provide timely alerts. By using Arduino and flame sensors, we aim to create a system that is not only cost-effective but also highly sensitive to fire hazards."
        },
        {
            "title": "Initial Prototype",
            "body": "The initial prototype involved connecting flame sensors to an Arduino board to detect fire. The system was programmed to trigger a buzzer and an LED light upon detecting flames. This phase focused on ensuring the sensors could accurately detect fire and relay the signal to the Arduino for processing."
        },
        {
            "title": "Challenges and Solutions",
            "body": "One major challenge was the sensor's sensitivity to false positives, such as detecting hot objects instead of actual flames. To address this, we implemented a filtering algorithm in the Arduino code to differentiate between fire and other heat sources. Additionally, we optimized the system's power consumption to ensure it could run for extended periods."
        },
        {
            "title": "System Integration",
            "body": "The final system integrates multiple flame sensors, an Arduino Uno, a buzzer, and an LED module. The sensors detect fire and send signals to the Arduino, which processes the data and triggers the alarm if a fire is confirmed. We also added a Wi-Fi module to send alerts to users' smartphones via a custom app."
        },
        {
            "title": "Conclusion and Future Plans",
            "body": "The FireAlert Detector successfully addresses the need for an affordable and reliable fire detection system. Future enhancements include integrating more advanced sensors, such as smoke detectors, and expanding the system to monitor multiple zones simultaneously. We also plan to explore cloud connectivity for remote monitoring and alerts."
        }
    ]
}